theproject/app/controllers/content/stipes_controller.rb

SELECT "stipes".* FROM "stipes" ORDER BY created_at DESC
---
  def index
    if params[:tag].present?
    @stipes = Stipe.tagged_with(params[:tag])
else
@stipes = Stipe.all.order("created_at DESC")